Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute Properties
The ReferenceModelObjectAttribute type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
Extrusion
 The extrusion vector.
Name
 The name of the product.
ObjectType
 The object type of the product.
Origin
 The origin of the extrusion.
ProfileName
 The name of the profile (often empty).
xDir
 The X-axis direction.
Top
See Also
Reference
ReferenceModelObjectAttribute Class
Tekla.Structures.Model.Collaboration Namespace